kunichiko/X68k-3mode-fdd-adapter/CH32X035/minyasx-v2/src/pcfdd/pcfdd_control.c
/*
  DMA1 Channel2 Global Interrupt Handler
 */
void DMA1_Channel2_IRQHandler(void) __attribute__((interrupt));
void DMA1_Channel2_IRQHandler(void) {
    dma_int_count++;
    uint32_t isr = DMA1->INTFR;

    if (isr & DMA_HTIF2) {
        DMA1->INTFCR = DMA_CHTIF2;
        process_block32(&cap_buf_active[0], READ_DATA_CAP_N / 2);
    }
    if (isr & DMA_TCIF2) {
        DMA1->INTFCR = DMA_CTCIF2;
        process_block32(&cap_buf_active[READ_DATA_CAP_N / 2], READ_DATA_CAP_N / 2);
    }
    if (isr & DMA_TEIF2) {
        DMA1->INTFCR = DMA_CTEIF2;
        // 必要なら再初期化
    }

    // まれにCC1OF対策でINTFR/CVRを読んでフラグ掃除
    (void)TIM1->INTFR;
    (void)TIM1->CH1CVR;
}

// 既存の分類カウンタ（classify_dt() で増やしているもの）
extern volatile uint32_t cnt_7ish, cnt_8ish, cnt_10ish, cnt_13ish, cnt_16ish;
extern volatile uint32_t cnt_other;

// 必要なら数値にしたい時用（表示など）
inline uint32_t fdd_bps_mode_to_value(fdd_bps_mode_t m) {
    switch (m) {
    case BPS_600K:
        return 600000;
    case BPS_500K:
        return 500000;
    case BPS_416K:
        return 416000;  // 416,667に丸めたければ 416667
    case BPS_300K:
        return 300000;
    case BPS_250K:
        return 250000;
    default:
        return 0;
    }
}

static inline fdd_bps_mode_t bin_index_to_mode(int idx) {
    switch (idx) {
    case 0:
        return BPS_600K;  // 7ish
    case 1:
        return BPS_500K;  // 8ish
    case 2:
        return BPS_416K;  // 10ish
    case 3:
        return BPS_300K;  // 13ish
    case 4:
        return BPS_250K;  // 16ish
    default:
        return BPS_UNKNOWN;
    }
}

#define VOTES_MIN 50         /* 有効票の最小数（ギャップや無信号を弾く） */
#define TOP_THRESHOLD_PCT 20 /* 最多ビンの下限比率 */

fdd_bps_mode_t pcfdd_bps_decide_and_reset(int drive) {
    if (drive < 0 || drive > 1) return BPS_UNKNOWN;
    rd_stats_t* S = (rd_stats_t*)&g_stats[drive];

    uint32_t c7 = S->cnt_7ish, c8 = S->cnt_8ish, c10 = S->cnt_10ish, c13 = S->cnt_13ish, c16 = S->cnt_16ish;
    S->cnt_7ish = S->cnt_8ish = S->cnt_10ish = S->cnt_13ish = S->cnt_16ish = S->cnt_other = 0;

    uint32_t votes = c7 + c8 + c10 + c13 + c16;
    ui_cursor(UI_PAGE_DEBUG_PCFDD, 0, 3 + drive * 2);
    ui_printf(UI_PAGE_DEBUG_PCFDD, "%d:%d:%d:%d:%d[%d:%d]\n",  //
              (int)c7 / 10, (int)c8 / 10, (int)c10 / 10, (int)c13 / 10, (int)c16 / 10, (int)S->cnt_other / 10, (int)votes / 10);
    if (votes < VOTES_MIN) return BPS_UNKNOWN;

    uint32_t bins[5] = {c7, c8, c10, c13, c16};
    int top = 0;
    for (int i = 1; i < 5; i++)
        if (bins[i] > bins[top]) top = i;

    if (bins[top] * 100U < votes * TOP_THRESHOLD_PCT) return BPS_UNKNOWN;
    return bin_index_to_mode(top);
}

//
//

static volatile pcfdd_ds_t g_current_ds = PCFDD_DS_NONE;

/* 別モジュールから現在のDRIVE_SELECT状態を通知する */
void pcfdd_set_current_ds(pcfdd_ds_t ds) {
    if (ds == g_current_ds) return;

    /* 一旦止めてから必要なら再開。DS0/DS1→0/1 にマップ */
    capture_pause();
    if (ds == PCFDD_DS0)
        capture_start_for_drive(0);
    else if (ds == PCFDD_DS1)
        capture_start_for_drive(1);

    g_current_ds = ds;
}

//
//
//

void step_dosv(int drive) {
    if (drive < 0 || drive > 1) {
        return;
    }
    // GreenPAK1の Vitrual Input 7 (bit0) に STEP_DOSV を接続している
    uint8_t gp1_vin = greenpak_get_virtualinput(1 - 1);
    gp1_vin |= (1 << 0);  // bit0 = 1 (STEP_DOSV = 1)
    greenpak_set_virtualinput(1 - 1, gp1_vin);
    Delay_Ms(1);
    gp1_vin &= ~(1 << 0);  // bit0 = 0 (STEP_DOSV = 0)
    greenpak_set_virtualinput(1 - 1, gp1_vin);
    Delay_Ms(3);
}

bool seek_to_track0(int drive) {
    ui_printf(UI_PAGE_LOG, "Seek Track0 (D:%d)\n", drive);
    if (drive < 0 || drive > 1) {
        return false;
    }

    int seek_count = 0;
    // シーク Part1
    GPIOB->BSHR = (1 << (2 + drive));  // Drive Select A/B active
    GPIOB->BSHR = (1 << 5);            // DIRECTION_DOSV active (内周方向)
    for (int i = 0; i < 10; i++) {
        step_dosv(drive);
    }
    // ここで 100msec待つ(Track00以外でシークを一度確定しないとDISK_CHANGEがクリアされないドライブがある)
    Delay_Ms(100);
    // シーク Part2
    GPIOB->BCR = (1 << 5);  // DIRECTION_DOSV inactive (正論理, 外周方向)
    Delay_Ms(1);
    seek_count = 0;
    while (seek_count < 200) {
        seek_count++;
        // TRACK0を見て、トラック0に到達したら抜ける
        if ((GPIOB->INDR & (1 << 10)) == 0) {
            // TRACK0_DOSV = 0 (Low) になった
            break;
        }
        step_dosv(drive);
    }
    Delay_Ms(100);
    GPIOB->BCR = (1 << (2 + drive));  // Drive Select A/B inactive
    Delay_Ms(100);

    // 戻り値: 200ステップ以内にトラック0に到達したらtrue
    return (seek_count < 200);
}

uint32_t last_index_ms = 0;
bool last_index_state = false;

static void process_initializing(minyasx_context_t* ctx, int drive) {
    if (ctx->drive[drive].state != DRIVE_STATE_INITIALIZING) return;

    // シークしてトラック0に戻す
    if (seek_to_track0(drive)) {
        ctx->drive[drive].state = DRIVE_STATE_MEDIA_DETECTING;
        ctx->drive[drive].rpm_measured = FDD_RPM_UNKNOWN;
        ctx->drive[drive].bps_measured = BPS_UNKNOWN;
    } else {
        // トラック0に戻れなかった =  ドライブが存在しない
        ctx->drive[drive].state = DRIVE_STATE_NOT_CONNECTED;
        ctx->drive[drive].rpm_measured = FDD_RPM_UNKNOWN;
        ctx->drive[drive].bps_measured = BPS_UNKNOWN;
    }
}

static void process_media_detecting(minyasx_context_t* ctx, int drive) {
    if (ctx->drive[drive].state != DRIVE_STATE_MEDIA_DETECTING) return;

    drive_status_t* d = &ctx->drive[drive];

    // なにはともあれ、READY_MCUや DISK_INを無効化して、アクセスを止める
    // そうすると、X68000側にはINDEXやREAD_DATAが届かなくなるので、
    // PCFDD側のDrive Selectをアクティブにしても問題なくなる
    // GP3の DISK_IN_A_n (Virtual Input 2=bit5)
    // GP3の DISK_IN_B_n (Virtual Input 3=bit4)

    // READY_MCUをInactiveにする
    GPIOB->BSHR = (drive == 0) ? GPIO_Pin_12 : GPIO_Pin_13;  // READY_MCU_A_n / READY_MCU_B_n (High=準備完了でない)
    // GP2,GP3の DISK_IN_x_n をDisableにする
    uint8_t gp2_vin = greenpak_get_virtualinput(2 - 1);
    gp2_vin |= (1 << (5 - drive));  // bit4/5を1にして、DISK_IN_x_nをDisableにする
    greenpak_set_virtualinput(2 - 1, gp2_vin);
    uint8_t gp3_vin = greenpak_get_virtualinput(3 - 1);
    gp3_vin |= (1 << (5 - drive));  // bit4/5を1にして、DISK_IN_x_nをDisableにする
    greenpak_set_virtualinput(3 - 1, gp3_vin);

    // 割り込みを禁止して、Drive Selectがアクティブな状態で確認する
    uint32_t systick_start = SysTick->CNTL;
    while (1) {
        if ((SysTick->CNTL - systick_start) > (100 * 1000 * 48)) {
            // 100msec以上待ってもDS0/DS1が解除されない場合は、一旦イジェクト状態で確定してしまう
            d->state = DRIVE_STATE_NO_MEDIA;
            d->rpm_measured = FDD_RPM_UNKNOWN;
            d->bps_measured = BPS_UNKNOWN;
            __enable_irq();
            return;
        }
        __disable_irq();
        uint32_t gpiob = GPIOB->INDR;
        if ((gpiob & 0xc) == 0) {
            break;
        }
        // DS0/DS1のいずれかがアクティブな状態
        __enable_irq();
        Delay_Ms(10);  // 少し待つ
    }
    // ここには割り込み禁止状態かつ、DS0/DS1のいずれもアクティブでない状態で来る

    // 2. TRACK00にシークする
    // これをするとPC FDDの DISK_CHANGEもクリアされる
    seek_to_track0(drive);

    // 3. PC FDD側のDrive Selectをアクティブにし、MOTOR_ONもアクティブにする
    GPIOB->BSHR = (1 << (2 + drive));  // Drive Select A/B active
    if ((GPIOB->INDR & (1 << 4)) == 0) {
        GPIOB->BSHR = (1 << 4);  // MOTOR_ON_DOSV active
        // モーターの回転が安定するまで 300msec待つ
        Delay_Ms(300);
    }

