kunichiko/X68k-3mode-fdd-adapter/CH32X035/minyasx-v2/src/pcfdd/pcfdd_control.c
    // RPMのタイムアウト監視
    {
        uint32_t now_cycles = SysTick->CNT;
        drive_t drv = current_drive_from_gpio();
        if (drv == DRIVE_NONE) {
            // NONEなら(ドライブがどちらもアクティブでない場合)一旦リセット
            s_current_drive = DRIVE_NONE;
            s_have_prev_edge = 0;
            s_last_edge_cycles = 0;
        } else if (s_current_drive == DRIVE_NONE) {
            // NONE→A/Bに変わった場合は、基準確立からやり直し
            s_current_drive = drv;
            s_have_prev_edge = 0;
            s_last_edge_cycles = now_cycles;

        } else {
            // ここではタイムアウトのみ検出
            // INDEXパルスが来ていれば、後述の「CC1IF」で処理される
            uint32_t delta_us = (now_cycles - s_last_edge_cycles) / 48u;
            if (delta_us > TIMEOUT_US) {
                index_width[drv] = 0;  // 500ms 以上エッジ無し → タイムアウト
                                       // 基準は保持（次のエッジで復帰）
            }
        }
    }

    // RPMの計測結果を反映
    for (int drive = 0; drive < 2; drive++) {
        if (index_width[drive] == 0) {
            // タイムアウト中
            ctx->drive[drive].rpm_measured = FDD_RPM_UNKNOWN;
            continue;
        }
        int margin = (200 - 166) / 2;
        if (166 - margin < index_width[drive] && index_width[drive] < 166 + margin) {
            ctx->drive[drive].rpm_measured = FDD_RPM_360;
        } else if (200 - margin < index_width[drive] && index_width[drive] < 200 + margin) {
            ctx->drive[drive].rpm_measured = FDD_RPM_300;
        } else {
            // それ以外は無視
            (void)0;
        }
    }

    // BPSの計測結果を反映
    fdd_bps_mode_t bps0 = pcfdd_bps_decide_and_reset(0); /* DS0のbpsを取得 */
    fdd_bps_mode_t bps1 = pcfdd_bps_decide_and_reset(1); /* DS1のbpsを取得 */
    ctx->drive[0].bps_measured = bps0;
    ctx->drive[1].bps_measured = bps1;

#if 0
    ui_cursor(UI_PAGE_DEBUG_PCFDD, 0, 4);
    ui_printf(UI_PAGE_DEBUG_PCFDD, "BPS:%3dk BPS:%3dk", fdd_bps_mode_to_value(bps0) / 1000, fdd_bps_mode_to_value(bps1) / 1000);
#endif
}

void pcfdd_update_setting(minyasx_context_t* ctx, int drive) {
    if (drive < 0 || drive > 1) return;
    // PCFDDコントローラの設定更新コードをここに追加
    // RPM設定が変わった場合に、MODE_SELECT_DOSVを切り替える
    switch (ctx->drive[drive].rpm_control) {
    case FDD_RPM_CONTROL_360:
        // 360RPMモード
        GPIOB->BSHR = (1 << 0);  // MODE_SELECT_DOSV = 1
        ctx->drive[drive].rpm_setting = FDD_RPM_360;
        ctx->drive[drive].rpm_measured = FDD_RPM_UNKNOWN;
        ctx->drive[drive].bps_measured = BPS_UNKNOWN;
        break;
    case FDD_RPM_CONTROL_300:
        // 300RPMモード
        GPIOB->BCR = (1 << 0);  // MODE_SELECT_DOSV = 0
        ctx->drive[drive].rpm_setting = FDD_RPM_300;
        ctx->drive[drive].rpm_measured = FDD_RPM_UNKNOWN;
        ctx->drive[drive].bps_measured = BPS_UNKNOWN;
        break;
    case FDD_RPM_CONTROL_9SCDRV:
        // 9SCDRV互換モード
        break;
    default:
        break;
    }
}

void pcfdd_try_eject(minyasx_context_t* ctx, int drive) {
    if (drive < 0 || drive > 1) return;
    if (ctx->drive[drive].eject_masked) {
        return;
    }
    pcfdd_force_eject(ctx, drive);
}

void pcfdd_force_eject(minyasx_context_t* ctx, int drive) {
    if (drive < 0 || drive > 1) return;
    drive_status_t* d = &ctx->drive[drive];
    if (d->state != DRIVE_STATE_READY) {
        return;
    }
    d->state = DRIVE_STATE_NO_MEDIA;
    d->rpm_measured = FDD_RPM_UNKNOWN;
    d->bps_measured = BPS_UNKNOWN;
}

/**
 * メディアの存在を調べ、挿入されていたらinsertedをtrueにする
 */
void pcfdd_detect_media(minyasx_context_t* ctx, int drive) {
    if (drive < 0 || drive > 1) return;
    drive_status_t* d = &ctx->drive[drive];
    if ((d->state != DRIVE_STATE_NO_MEDIA) &&  //
        (d->state != DRIVE_STATE_READY)) {
        return;
    }
    d->state = DRIVE_STATE_MEDIA_DETECTING;
    d->rpm_measured = FDD_RPM_UNKNOWN;
    d->bps_measured = BPS_UNKNOWN;
}

char* pcfdd_state_to_string(drive_state_t state) {
    switch (state) {
    case DRIVE_STATE_POWER_OFF:
        return "-----";
    case DRIVE_STATE_NOT_CONNECTED:
        return "*****";
    case DRIVE_STATE_DISABLED:
        return "Disbl";
    case DRIVE_STATE_INITIALIZING:
        return "Init.";
    case DRIVE_STATE_MEDIA_DETECTING:
        return ">>>>>";
    case DRIVE_STATE_NO_MEDIA:
        return "Eject";
    case DRIVE_STATE_READY:
        return "Ready";
    default:
        return "Unknown";
    }
}
